OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf8520.h
extern __at(0x0FFD) __sfr TOS;
extern __at(0x0FFD) __sfr TOSL;
extern __at(0x0FFE) __sfr TOSH;
extern __at(0x0FFF) __sfr TOSU;

//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define __CONFIG1H              0x300001
#define __CONFIG2L              0x300002
#define __CONFIG2H              0x300003
#define __CONFIG3L              0x300004
#define __CONFIG3H              0x300005
#define __CONFIG4L              0x300006
#define __CONFIG5L              0x300008
#define __CONFIG5H              0x300009
#define __CONFIG6L              0x30000A
#define __CONFIG6H              0x30000B
#define __CONFIG7L              0x30000C
#define __CONFIG7H              0x30000D

//----------------------------- CONFIG1H Options -------------------------------

#define _LP_OSC                 0xF8    // LP oscillator.
#define _OSC_LP_1H              0xF8    // LP oscillator.
#define _XT_OSC                 0xF9    // XT oscillator.
#define _OSC_XT_1H              0xF9    // XT oscillator.
#define _HS_OSC                 0xFA    // HS oscillator.
#define _OSC_HS_1H              0xFA    // HS oscillator.
#define _RC_OSC                 0xFB    // RC oscillator w/ OSC2 configured as divide-by-4 clock output.
#define _OSC_RC_1H              0xFB    // RC oscillator w/ OSC2 configured as divide-by-4 clock output.
#define _EC_OSC                 0xFC    // EC oscillator w/ OSC2 configured as divide-by-4 clock output.
#define _OSC_EC_1H              0xFC    // EC oscillator w/ OSC2 configured as divide-by-4 clock output.
#define _ECIO_OSC               0xFD    // EC oscillator w/ OSC2 configured as RA6.
#define _OSC_ECIO_1H            0xFD    // EC oscillator w/ OSC2 configured as RA6.
#define _HSPLL_OSC              0xFE    // HS oscillator with PLL enabled; clock frequency = (4 x FOSC).
#define _OSC_HSPLL_1H           0xFE    // HS oscillator with PLL enabled; clock frequency = (4 x FOSC).
#define _RCIO_OSC               0xFF    // RC oscillator w/ OSC2 configured as RA6.
#define _OSC_RCIO_1H            0xFF    // RC oscillator w/ OSC2 configured as RA6.
#define _OSCS_ON_1H             0xDF    // Timer1 Oscillator system clock switch option is enabled (oscillator switching is enabled).
#define _OSCS_OFF_1H            0xFF    // Oscillator system clock switch option is disabled (main oscillator is source).

//----------------------------- CONFIG2L Options -------------------------------

#define _PWRT_ON_2L             0xFE    // PWRT enabled.
#define _PWRT_OFF_2L            0xFF    // PWRT disabled.
#define _BOR_OFF_2L             0xFD    // Brown-out Reset disabled.
#define _BOR_ON_2L              0xFF    // Brown-out Reset enabled.
#define _BORV_45_2L             0xF3    // VBOR set to 4.5V.
#define _BORV_42_2L             0xF7    // VBOR set to 4.2V.
#define _BORV_27_2L             0xFB    // VBOR set to 2.7V.
#define _BORV_20                0xFF    // VBOR set to 2.5V.
#define _BORV_25_2L             0xFF    // VBOR set to 2.5V.

//----------------------------- CONFIG2H Options -------------------------------

#define _WDT_OFF_2H             0xFE    // WDT disabled (control is placed on the SWDTEN bit).
#define _WDT_ON_2H              0xFF    // WDT enabled.
#define _WDTPS_1_2H             0xF1    // 1:1.
#define _WDTPS_2_2H             0xF3    // 1:2.
#define _WDTPS_4_2H             0xF5    // 1:4.
#define _WDTPS_8_2H             0xF7    // 1:8.
#define _WDTPS_16_2H            0xF9    // 1:16.
#define _WDTPS_32_2H            0xFB    // 1:32.
#define _WDTPS_64_2H            0xFD    // 1:64.
#define _WDTPS_128_2H           0xFF    // 1:128.

//----------------------------- CONFIG3L Options -------------------------------

#define _XMC_MODE               0xFC    // Extended Microcontroller mode.
#define _MODE_EM_3L             0xFC    // Extended Microcontroller mode.
#define _MPB_MODE               0xFD    // Microprocessor with Boot Block mode.
#define _MODE_MPB_3L            0xFD    // Microprocessor with Boot Block mode.
#define _MP_MODE                0xFE    // Microprocessor mode.
#define _MODE_MP_3L             0xFE    // Microprocessor mode.
#define _MC_MODE                0xFF    // Microcontroller mode.
#define _MODE_MC_3L             0xFF    // Microcontroller mode.
#define _WAIT_ON_3L             0x7F    // Wait selections for table reads and table writes are determined by the WAIT1:WAIT0 bits (MEMCOM<5:4>).
#define _WAIT_OFF_3L            0xFF    // Wait selections unavailable for table reads and table writes.

//----------------------------- CONFIG3H Options -------------------------------

#define _CCP2MX_RE7             0xFE    // CCP2 is multiplexed with RB3 in Extended Microcontroller, Microprocessor or Microprocessor with Boot Block mode. Or with RE7 in Microcontroller mode.
#define _CCP2MX_OFF             0xFE    // CCP2 is multiplexed with RB3 in Extended Microcontroller, Microprocessor or Microprocessor with Boot Block mode. Or with RE7 in Microcontroller mode.
#define _CCP2MUX_OFF_3H         0xFE    // CCP2 is multiplexed with RB3 in Extended Microcontroller, Microprocessor or Microprocessor with Boot Block mode. Or with RE7 in Microcontroller mode.
#define _CCP2MX_RE7_3H          0xFE    // CCP2 is multiplexed with RB3 in Extended Microcontroller, Microprocessor or Microprocessor with Boot Block mode. Or with RE7 in Microcontroller mode.
#define _CCP2MUX_RE7_3H         0xFE    // CCP2 is multiplexed with RB3 in Extended Microcontroller, Microprocessor or Microprocessor with Boot Block mode. Or with RE7 in Microcontroller mode.
#define _CCP2MX_RC1             0xFF    // CCP2 input/output is multiplexed with RC1.
#define _CCP2MX_ON              0xFF    // CCP2 input/output is multiplexed with RC1.
#define _CCP2MUX_ON_3H          0xFF    // CCP2 input/output is multiplexed with RC1.
#define _CCP2MX_RC1_3H          0xFF    // CCP2 input/output is multiplexed with RC1.
#define _CCP2MUX_RC1_3H         0xFF    // CCP2 input/output is multiplexed with RC1.

